In [352]:
import numpy as np
import pandas as pd

# I.  Bases : création d'une datafame et extraction de données

* Définir ou créer une dataframe 
* Afficher en tableau
* Renvoyer des colonnes
* Extraire des données
* Méthode .iterrows()
* Sélectionner des données avec conditions
* Ajouter des données
* Récupérer la liste sans doublons de lignes
* Ajouter un attribut (une colonne)
* Obtenir les valeurs distinctes d'une colonne
* Importer un fichier csv (comma separated values) dans une dataframe

In [353]:
fam_pandas = [[100,5,20,80], [50,2.5,10,40],[110,6,22,80]]
noms_pandas = ['maman', 'bébé', 'papa']
mesu_pandas = ['pattes', 'poils', 'queue', 'ventre']

In [354]:
# Définir ou créer une dataframe

fam_pan_np = np.array(fam_pandas)
fam_pan_df = pd.DataFrame(fam_pan_np, index = noms_pandas, columns = mesu_pandas)

print(fam_pan_np)

# Afficher en tableau

fam_pan_df
fam_pan_df.head(3) # pratique quand le tableau est trop grand...

[[100.    5.   20.   80. ]
 [ 50.    2.5  10.   40. ]
 [110.    6.   22.   80. ]]

       pattes  poils  queue  ventre
maman   100.0    5.0   20.0    80.0
bébé     50.0    2.5   10.0    40.0
papa    110.0    6.0   22.0    80.0

In [355]:
# Renvoyer des colonnes

print(fam_pan_df["ventre"]) # objet de type 'pandas.Series'
print(fam_pan_df.pattes)
print(fam_pan_df["queue"].values) # vecteur correspondant aux valeurs seul
print(fam_pan_df.poils.values) # vecteur correspondant aux valeurs seul

maman    80.0
bébé     40.0
papa     80.0
Name: ventre, dtype: float64
maman    100.0
bébé      50.0
papa     110.0
Name: pattes, dtype: float64
[20. 10. 22.]
[5.  2.5 6. ]

In [356]:
# Extraire des données

print(fam_pan_df.iloc[2]) # Avec iloc(), indexation positionnelle
print(fam_pan_df.loc["papa"]) # Avec loc(), indexation par label

pattes    110.0
poils       6.0
queue      22.0
ventre     80.0
Name: papa, dtype: float64
pattes    110.0
poils       6.0
queue      22.0
ventre     80.0
Name: papa, dtype: float64

In [357]:
# méthode .iterrows()
# renvoie le contenu de chaque ligne sous forme d'un tuple (< nom_ligne >, < données >)

for nom_ligne, données_ligne in fam_pan_df.iterrows(): # .iterrows renvoie une liste de tuples (nom ligne, données)
    print("Voici le panda %s :\n" %nom_ligne + str(données_ligne) + "\n--------------------")

Voici le panda maman :
pattes    100.0
poils       5.0
queue      20.0
ventre     80.0
Name: maman, dtype: float64
--------------------
Voici le panda bébé :
pattes    50.0
poils      2.5
queue     10.0
ventre    40.0
Name: bébé, dtype: float64
--------------------
Voici le panda papa :
pattes    110.0
poils       6.0
queue      22.0
ventre     80.0
Name: papa, dtype: float64
--------------------

In [358]:
# Sélectionner des données avec conditions

masque = fam_pan_df["ventre"] == 80 # renvoie un tableau de booléens pour chaque panda (ventre de 80 cm ?)
print(masque)
pan_v80 = fam_pan_df[masque] # utilisation d'un masque booléen pour filtrer des données
pan_vnon80 = fam_pan_df[~masque]
print("\n Les pandas à ventre de 80 cm sont :") # ou "famille_panda_df[famille_panda_df["ventre"] == 80]"
print(pan_v80.index)
print("\n Les pandas à ventre autre que 80 cm sont :")
print(pan_vnon80.index)

maman     True
bébé     False
papa      True
Name: ventre, dtype: bool

 Les pandas à ventre de 80 cm sont :
Index(['maman', 'papa'], dtype='object')

 Les pandas à ventre autre que 80 cm sont :
Index(['bébé'], dtype='object')

In [359]:
# Ajouter des données

autres_pan = pd.DataFrame([[105,4,19,80],[100,5,20,80]],columns = fam_pan_df.columns)     
# deux nouveaux pandas
                                 # même colonnes que famille_panda_df
all_pan = fam_pan_df.append(autres_pan)
print(all_pan)

       pattes  poils  queue  ventre
maman   100.0    5.0   20.0    80.0
bébé     50.0    2.5   10.0    40.0
papa    110.0    6.0   22.0    80.0
0       105.0    4.0   19.0    80.0
1       100.0    5.0   20.0    80.0

In [360]:
# Récupérer la liste sans doublons de lignes

pan_uni = all_pan.drop_duplicates() # garde le premier de chaque doublon
print(pan_uni)

       pattes  poils  queue  ventre
maman   100.0    5.0   20.0    80.0
bébé     50.0    2.5   10.0    40.0
papa    110.0    6.0   22.0    80.0
0       105.0    4.0   19.0    80.0

In [361]:
# Divers

# accéder aux noms des colonnes
print(fam_pan_df.columns) 

# ajouter un attribut (une colonne)
fam_pan_df["sexe"] = ["f", "f", "m"]  # la maman et le bébé sont des femelles, le papa est un mâle

print(fam_pan_df)
print(len(fam_pan_df)) # obtenir le nombre de lignes
print(all_pan.ventre.unique()) # obtenir les valeurs distinctes d'une colonne

Index(['pattes', 'poils', 'queue', 'ventre'], dtype='object')
       pattes  poils  queue  ventre sexe
maman   100.0    5.0   20.0    80.0    f
bébé     50.0    2.5   10.0    40.0    f
papa    110.0    6.0   22.0    80.0    m
3
[80. 40.]

In [362]:
# importer un fichier csv (comma separated values) dans une dataframe
import os
print(os.getcwd()) # pour connaître le chemin du répertoire courant
data = pd.read_csv("hubble_data.csv", sep=",") # si non dans le rep courant :"/home/user1/Bureau/data.csv"

C:\Users\Maryse\Desktop\EN COURS\OPENCLASSROOMS\05-Librairies Python Data Science\GIT-Jupyter

In [363]:
data # des indexs ont été rajoutés, les titres de colonnes ont été détectés
data.head(3)

   distance  recession_velocity
0     0.032                 170
1     0.034                 290
2     0.214                -130

In [364]:
print(str(data.columns[0]) + "---" + str(data.columns[1]))
print(data.index)
print(np.array([data["distance"]],np.newaxis)) # change la colonne en ligne

distance---recession_velocity
RangeIndex(start=0, stop=24, step=1)
[[0.032 0.034 0.214 0.263 0.275 0.275 0.45  0.5   0.5   0.63  0.8   0.9
  0.9   0.9   0.9   1.    1.1   1.1   1.4   1.7   2.    2.    2.    2.   ]]

# II.  Manipulation avancée : exemple sur les données du titanic

In [365]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')

### Affichage partiel

In [366]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [367]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [368]:
titanic.describe(include="all")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Sélections diverses et élimitation

Pour enlever les doublons dans un échantillon sou sous-tableau quelconque :

In [369]:
titanic.age.unique() # affiche la liste des âges en enlevant tous les doublons

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

Et pour supprimer des données (lignes ou colonnes) :

Remarque : les index ne sont pas modifiés !!!

In [370]:
# Supprimer une ligne
titanic.drop(0, inplace = False).head(3) # ne modifie pas la dataframe d'origine
#titanic.drop(0, inplace = True) # modifie la dataframe d'origine

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False

In [371]:
#Supprimer une colonne
titanic.drop(columns=["age"], inplace = False).head(3) # ne modifie pas la dataframe d'origine
#titanic.drop(columns=["age"], inplace = True) # modifie la dataframe d'origine

,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

### Au sujet des valeurs non rensignées (NaN) :

Remarquez que l'un d'entre eux n'est pas renseigné :

In [372]:
print("Les âges des dix premiers passagers :")
print(np.array(titanic.age.head(10)))

Les âges des dix premiers passagers :
[22. 38. 26. 35. 35. nan 54.  2. 27. 14.]

Pour que l'âge non renseigné soit replacé par 0 :

In [373]:
print("Les âges des dix premiers passagers :")
print(np.array(titanic.fillna(value={"age": 0}).age.head(10)))

Les âges des dix premiers passagers :
[22. 38. 26. 35. 35.  0. 54.  2. 27. 14.]

Pour que les données (lignes) qui comportent au moins 1 NaN soient carrément éliminées :

In [374]:
print("Les âges des dix premiers passagers (seulement les lignes sans aucun NaN):")
print(np.array(titanic.dropna().age.head(10)))

Les âges des dix premiers passagers (seulement les lignes sans aucun NaN):
[38. 35. 54.  4. 58. 34. 28. 19. 49. 65.]

Remarque : on peut aussi appliquer cela aux colonnes :

In [375]:
print("Voici les titres des colonnes dont aucune ligne n'a de NaN :")
print(np.array(titanic.dropna(axis = "columns").columns))
nbe_ss_NaN = len(np.array(titanic.dropna(axis = "columns").columns))
nbe_tot = len(np.array(titanic.columns))
print("-> Seulement {} titres sur {} n'ont aucun 'NaN'.".format(nbe_ss_NaN,nbe_tot))

Voici les titres des colonnes dont aucune ligne n'a de NaN :
['survived' 'pclass' 'sex' 'sibsp' 'parch' 'fare' 'class' 'who'
 'adult_male' 'alive' 'alone']
-> Seulement 11 titres sur 15 n'ont aucun 'NaN'.

### Renommer les colonnes et les index :

Voici comment renommer une colomne simplement :

In [376]:
titanic.rename(columns={"sex":"sexe"}).head(3)

,survived,pclass,sexe,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

Et voici comment changer les index :

In [377]:
f = lambda x: x+1
titanic.rename(index=f).head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

### Tableaux croisés dynamiques

On utilise la méthode .pivot_table de la manière suivante (par défaut, donne la moyenne, sinon on peut ajouter un "aggfunc") :

* (<colonne de la valeur à moyenner>, index='nom_index', columns='nom_column')

* (<colonne de la valeur à moyenner>, index='nom_index', columns='nom_column',aggfunc="sum")

In [378]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [379]:
titanic.pivot_table('survived', index='sex', columns='class', aggfunc="sum")

class   First  Second  Third
sex
female     91      70     72
male       45      17     47

Pour catégoriser certaines colonnes, on peut donner les plages qu'on veut, et utiliser un 'pd.cut' de la dataframe dont on se servira comme un masque.

Le .pivot_table peut prendre plusieurs colonnes en index et en colonnes :

In [449]:
# ne pas considérer les lignes qui n'ont pas l'âge renseigner (sans modifier la dataframe de départ)
titanic_bis = titanic.dropna(subset=['age'],inplace=False)

# pour faire 3 catégories égales, en nombres entiers, quels que soient les âges
age_max = np.max(titanic.age[titanic_bis.index.values])
age_min = np.min(titanic.age[titanic_bis.index.values])
cat_age = np.array(np.around(np.linspace(age_min,age_max,4),decimals=0), int)
fare_max = np.max(titanic.fare[titanic_bis.index.values])
fare_min = np.min(titanic.fare[titanic_bis.index.values])
cat_fare = np.array(np.around(np.linspace(fare_min,fare_max,20),decimals=0), int)

# pour afficher un tableau croisé avec plusieurs sous-index et sous-colonnes
mask_cut_age = pd.cut(titanic_bis['age'], cat_age) # découpe les âges en tronçons
mask_cut_fare = pd.cut(titanic_bis['age'], cat_fare) # découpe les âges en tronçons

titanic_bis.pivot_table('survived', ['sex', mask_cut_age], ['class', mask_cut_fare],aggfunc="sum")

class             First                    Second                     Third  \
age             (0, 27] (27, 54] (54, 81] (0, 27] (27, 54] (54, 81] (0, 27]
sex    age
female (0, 27]     27.0      NaN      NaN    30.0      NaN      NaN    38.0
       (27, 53]     NaN     46.0      NaN     NaN     36.0      NaN     NaN
       (53, 80]     NaN      2.0      7.0     NaN      1.0      1.0     NaN
male   (0, 27]     11.0      NaN      NaN    10.0      NaN      NaN    25.0
       (27, 53]     NaN     26.0      NaN     NaN      4.0      NaN     NaN
       (53, 80]     NaN      0.0      3.0     NaN      0.0      1.0     NaN

class
age             (27, 54] (54, 81]
sex    age
female (0, 27]       NaN      NaN
       (27, 53]      8.0      NaN
       (53, 80]      NaN      1.0
male   (0, 27]       NaN      NaN
       (27, 53]     13.0      NaN
       (53, 80]      NaN      0.0

Exemples d'extraction conditionnelle de données :

In [450]:
### nbe_age_nan = np.sum(pd.isna(titanic.age))
# pour connaître le nombre de lignes dont l'âge n'est pas renseigné
print("nombre initial des passagers :", len(titanic))
print("nombre des passagers dont toutes les données sont renseignées :", len(titanic_bis))
print("nombre des passagers dont l'âge n'est pas renseigné :", nbe_age_nan)
plus_70ans = titanic_bis[titanic_bis["age"]>70].index.values
trans = titanic_bis.age[plus_70ans].values[:,np.newaxis]
trans2 = titanic_bis.sex[plus_70ans].values[:,np.newaxis]
trans3 = np.array(titanic_bis['class'][plus_70ans].values)[:,np.newaxis]
trans4 = titanic_bis.survived[plus_70ans].values[:,np.newaxis]
tab = np.hstack([trans, trans2, trans3, trans4])

#print(trans3)
print("numéro d'index des passagers entre 70 et 80 ans, suivi de leur âge et sexe :\n")
plus_70ans_df = pd.DataFrame(tab, index = plus_70ans, columns = ['+ de 70 ans', 'sexe','classe', 'survie ?'])
plus_70ans_df

nombre initial des passagers : 891
nombre des passagers dont toutes les données sont renseignées : 714
nombre des passagers dont l'âge n'est pas renseigné : 177
numéro d'index des passagers entre 70 et 80 ans, suivi de leur âge et sexe :

    + de 70 ans  sexe classe survie ?
96           71  male  First        0
116        70.5  male  Third        0
493          71  male  First        0
630          80  male  First        1
851          74  male  Third        0

Exemple similaire, mais beaucoup plus compact pour obtenir les mêmes données grâces au tableaux dynamiques croisés !!!

In [451]:
masque = ((titanic_bis["age"]>70).values)*((titanic_bis["sex"]=='male').values)
titanic_bis[masque].pivot_table('survived', ['class', 'age'],aggfunc="sum")

            survived
class age
First 71.0         0
      80.0         1
Third 70.5         0
      74.0         0

# III.  Algèbre relationnelle avec Pandas

Référence très intéressante sur la comparaison de Pandas et du SQL :

https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/comparison_with_sql.html

Création de "Series" et "Dataframes" + quelques opérations de base.

In [455]:
import numpy as np
import pandas as pd

# On peut créer une Series à partir d'une list
data = pd.Series([0.25, 0.5, 0.75, 1.0])
print("data ressemble à un tableau Numpy: ", data)

# On peut spécifier des indices à la main
data = pd.Series([0.25, 0.5, 0.75, 1.0],
         index=['a', 'b', 'c', 'd'])
print("data ressemble à un dict en Python: ", data)
print(data['b'])

# On peut même créer une Serie directement à partir d'une dict
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
area_dict = {'California': 423967, 
             'Texas': 695662,
             'New York': 141297, 
             'Florida': 170312,
             'Illinois': 149995}
population = pd.Series(population_dict)
area = pd.Series(area_dict)
print(population)
# Que pensez vous de cette ligne?
print(population['California':'Florida'])

data ressemble à un tableau Numpy:  0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64
data ressemble à un dict en Python:  a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64
0.5
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
dtype: int64

Combinaison de plusieurs "Series" en colonnes

In [456]:
# A partir d'une Series
df = pd.DataFrame(population, columns=['population'])
print(df)

# A partir d'une list de dict
data = [{'a': i, 'b': 2 * i}
        for i in range(3)]
df = pd.DataFrame(data)
print(df)

# A partir de plusieurs Series
df = pd.DataFrame({'population': population,
              'area': area})
print(df)

# A partir d'un tableau Numpy de dimension 2
df = pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])
print(df)

# Une fonction pour générer facilement des DataFrame. 
# Elle nous sera utile dans la suite de ce chapitre.
def make_df(cols, ind):
    """Crée rapidement des DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

# exemple
make_df('ABC', range(3))

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
   a  b
0  0  0
1  1  2
2  2  4
            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995
        foo       bar
a  0.365135  0.678639
b  0.728197  0.674142
c  0.243763  0.519125

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

### 1. Projection et restriction (.loc et .iloc)

* Projection : sélection de certaines colonnes
* Restriction : sélection de certaines lignes.

In [494]:
### Sur les "Series"

data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
#data = pd.DataFrame([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])

# On peut désigner un élément d'une Series par son index
print("data.loc['b'] : ", data.loc['b'])

# Ou bien par sa position
print("data.iloc[1] : ", data.iloc[1])

data

data.loc['b'] :  0.5
data.iloc[1] :  0.5

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [497]:
### Sur les Dataframes

data = pd.DataFrame({'area':area, 'pop':population})
print(data)

data.loc[:'New York', :'area'] # toutes les données du début à New York (index) et area (columns)

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

              area
California  423967
Texas       695662
New York    141297

### 2. Union (pd.concat)

Union de deux tableaux : créer un troisième tableau qui contient toutes les lignes du premier et toutes les lignes du second.

In [498]:
### Sur des "Series"

ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
print(ser1)
print(ser2)

pd.concat([ser1, ser2])  # concaténation "verticale" par défaut

1    A
2    B
3    C
dtype: object
4    D
5    E
6    F
dtype: object

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [499]:
### Sur des "Dataframes"

df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
print(df1)
print(df2)

pd.concat([df1, df2]) # concaténation "verticale" par défaut

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

 Attention : par défaut,  "pd.concat"  assemble ses arguments "verticalement".
 Pour changer ce comportement, on peut utiliser l'argument  axis.

In [504]:
pd.concat([df1, df2], axis=1) # concaténation "horizontale"

     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

***Index hiérarchiques***

La concaténation préserve les index !

Par exemple, si les deux DataFrames donnés en arguments ont des index en commun, le résultat final aura des index dupliqués, mais il est possible de rajouter un deuxième index.

In [464]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index  # Rend les index identiques : Nous avons alors des index dupliqués

print(pd.concat([x, y]))

# Nous pouvons spécifier des index hiérarchiques...
hdf = pd.concat([x, y], keys=['x', 'y'])
print(hdf)

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [505]:
# ... et ensuite s'en servir pour extraire des données : 
hdf.loc[('x', 1),]

A    A1
B    B1
Name: (x, 1), dtype: object

### 3. Jointure (pd.merge)

Jointure : assembler les informations d'un tableau A avec celles d'un autre tableau B selon un  critère choisi

**Attention à la cardinalité des dataframes !!**

* _Un-à-un (one-to-one)_ : une ligne quelconque du tableau A correspond à une unique ligne du tableau B, et qu'une ligne de B correspond à une unique ligne du tableau A.

* _Un-à-plusieurs (one-to-many)_ : une ligne quelconque de A correspond à une ligne de B, mais qu'une ligne de B peut correspondre à plusieurs lignes de A.

* _Plusieurs-à-plusieurs (many-to-many)_ : une ligne de A peut correspondre à plusieurs lignes de B, et qu'une ligne de B peut correspondre à plusieurs lignes de A.

'pd.merge'  ne fait pas la différence entre ces 3 cardinalités : elle s'utilise exactement de la même manière dans les 3 cas.

#### Jointure interne (par défaut)

In [506]:
########################################""
# Cardinalité un à un : cas le plus simple

df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'department': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'date': [2004, 2008, 2012, 2014]})
print(df1)
print(df2)

pd.merge(df1, df2)

  employee   department
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  date
0     Lisa  2004
1      Bob  2008
2     Jake  2012
3      Sue  2014

  employee   department  date
0      Bob   Accounting  2008
1     Jake  Engineering  2012
2     Lisa  Engineering  2004
3      Sue           HR  2014

In [469]:
# En cas de noms de colonnes différents :

df2 = pd.DataFrame({'emp_name': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'date': [2004, 2008, 2012, 2014]})

pd.merge(df1, df2, left_on= "employee", right_on= "emp_name")

  employee   department emp_name  date
0      Bob   Accounting      Bob  2008
1     Jake  Engineering     Jake  2012
2     Lisa  Engineering     Lisa  2004
3      Sue           HR      Sue  2014

In [509]:
########################################""
# Cardinalité un à un ou un à plusieurs

df4 = pd.DataFrame({'department': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3)
print(df4)

# pas besoin de spécifier la colonne sur laquelle on fait la jointure si elles portent le même nom
pd.merge(df3, df4)

  employee   department  date
0      Bob   Accounting  2008
1     Jake  Engineering  2012
2     Lisa  Engineering  2004
3      Sue           HR  2014
    department supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

  employee   department  date supervisor
0      Bob   Accounting  2008      Carly
1     Jake  Engineering  2012      Guido
2     Lisa  Engineering  2004      Guido
3      Sue           HR  2014      Steve

In [510]:
########################################
# Cardinalité plusieurs à plusieurs

df5 = pd.DataFrame({'department': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'competence': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
print(df1)
print(df5)

# pas besoin de spécifier la colonne sur laquelle on fait la jointure si elles portent le même nom
pd.merge(df1, df5)

  employee   department
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
    department    competence
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

  employee   department    competence
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

#### Jointure externe (outer join)

In [511]:
df6 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue', 'Lea'],
                    'department': ['Accounting', 'Engineering', 'Engineering', 'HR', 'Engineering']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'date': [2004, 2008, 2012, 2014]})
print(df6)
print(df2)

  employee   department
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4      Lea  Engineering
  employee  date
0     Lisa  2004
1      Bob  2008
2     Jake  2012
3      Sue  2014

In [515]:
#pd.merge(df6, df2)  # inner

pd.merge(df6, df2, how="left") # inner left
# -> c'est celle qui convient ici (il y a une donnée en + ds la data frame de gauche)

#pd.merge(df6, df2, how="right") # inner right
#pd.merge(df6, df2, how="outer") # outer

  employee   department    date
0      Bob   Accounting  2008.0
1     Jake  Engineering  2012.0
2     Lisa  Engineering  2004.0
3      Sue           HR  2014.0
4      Lea  Engineering     NaN

### 4. Produit cartésien

Le produit cartésien renvoie toutes les combinaisons possibles des éléments de deux colonnes.

In [520]:
###########################
# Première manière de faire...

# Nous ajoutons une nouvelle colonne "clé" à df1 et df2, qui contient toujours
# la même valeur, ici 0.
df1.assign(key=0) # autre manière de faire : df1['key'] = 0
df2.assign(key=0) # autre manière de faire : df2['key'] = 0

print(df1)
print(df2)

# La jointure plusieurs-à-plusieurs
produit_cartesien = pd.merge(df1, df2, on='key')

# Effaçons la colonne key qui n'est plus utile
produit_cartesien.drop('key',1, inplace=True)

produit_cartesien.head(5) # toutes les combinaisons sont effectuées

# remarque : comme df1 et df2 ont toutes deux une colonne employee, elles sont dupliquées et renommées!!!

  employee   department  key
0      Bob   Accounting    0
1     Jake  Engineering    0
2     Lisa  Engineering    0
3      Sue           HR    0
  employee  date  key
0     Lisa  2004    0
1      Bob  2008    0
2     Jake  2012    0
3      Sue  2014    0

  employee_x   department employee_y  date
0        Bob   Accounting       Lisa  2004
1        Bob   Accounting        Bob  2008
2        Bob   Accounting       Jake  2012
3        Bob   Accounting        Sue  2014
4       Jake  Engineering       Lisa  2004

In [483]:
###########################
# Deuxième manière de faire..

# ...permettant de condenser en une seule ligne :

pd.merge(df1.assign(key=0), df2.assign(key=0), on='key').drop('key', axis=1).head(5)

  employee_x   department employee_y  date
0        Bob   Accounting       Lisa  2004
1        Bob   Accounting        Bob  2008
2        Bob   Accounting       Jake  2012
3        Bob   Accounting        Sue  2014
4       Jake  Engineering       Lisa  2004

### 5. Agrégation (.groupby)

Pas vraiment une opération relationnelle mais très utile.

Par exemple lorsque l'on veut calculer un résultat qui porte sur plusieurs lignes d'une table. On dit que l'on agrège ces lignes, c'est-à-dire que l'on forme des agrégats pour effectuer sur eux une opération.

Même fonction que le "groupby" en SQL

In [529]:
# Sur des "Series"

rng = np.random.RandomState(42)

# Une Series avec cinq nombres aléatoires
ser = pd.Series(rng.rand(5))
print(ser.values)
print(ser.sum())
print(ser.mean())

[0.37454012 0.95071431 0.73199394 0.59865848 0.15601864]
2.811925491708157
0.5623850983416314

In [487]:
# Sur des "Dataframes"

df = pd.DataFrame({'A': rng.rand(5),
                   'B': rng.rand(5)})
                   
# Par colonne
print(df.mean())

# Par ligne
print(df.mean(axis='columns'))

A    0.477888
B    0.443420
dtype: float64
0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [537]:
### Agrégation par groupe (similaire au GROUPBY du SQL)

df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': [10,11,10,9,10,10]})                  
print(df)

# Création d'un objet de type "DataFrameGroupBy", pas imprimable (gb)  
gb = df.groupby('key')
print(gb)

# Application des fonctions d'agrégation sur l'ensemble...
print(gb.sum()) # ou encore "print(gb.mean())"

  key  data1  data2
0   A      0     10
1   B      1     11
2   C      2     10
3   A      3      9
4   B      4     10
5   C      5     10
<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x000001A8822E7C88>
     data1  data2
key
A        3     19
B        5     21
C        7     20

In [543]:
#... ou partielle
s = gb['data1'].sum()
m = gb['data2',].mean()
print(s, m)

groupped = pd.concat([m,s], axis=1)
groupped.columns = ["data2_moyenne","data1_somme"] # ne pas oublier de mettre des titres appropriés
print(groupped) # tableau avec une colonne où c'est la moyenne sur un groupby de la key et l'autre la somme

key
A    3
B    5
C    7
Name: data1, dtype: int64      data2
key
A      9.5
B     10.5
C     10.0
     data2_moyenne  data1_somme
key
A              9.5            3
B             10.5            5
C             10.0            7